import os
os.environ['KMP_DUPLICATE_LIB_OK'] = 'TRUE'
from sentence_transformers import SentenceTransformer
import time
# 1. 加载模型
# 如果你已经把模型文件下载到了本地文件夹，把路径指向那个文件夹
# 如果没有，直接写 "Qwen/Qwen3-Embedding-4B" 它会自动去网上下载
model_path = "./mnx/core_model/Qwen3-Embedding-0.6B" 
model = SentenceTransformer(model_path)

# 2. 准备数据 (你的投诉文本)
sentences = [
    "生态环境和资源保护包括环境污染(如非法排放污水、废气、固体废弃物)、生态破坏(如非法采矿、非法占用农用地、破坏森林植被等)，以及自然资源保护(如水资源、矿产资源、野生动植物资源保护等）",
    "食品药品安全(针对生产、销售假药劣药，不符合食品安全标准的食品(如过期食品、添加非法添加剂、虚假标注食品成分等)，以及药品、食品生产经营环节中的违法违规行为，侵害众多消费者合法权益的情形)",
    "国有财产保护(涉及防止国有财产流失，如企业或个人通过虚报项目、骗取国家专项补贴资金，非法侵占、挪用国有资产，以及国有企事业单位资产处置中的违法违规行为等)",
    "国有土地使用权出让(监督国有土地出让的合法性，包括土地使用者未按规定开发土地、非法转让土地使用权，或政府部门违法低价出让土地、违规审批土地用途变更等行为)",
    "英雄烈士保护(维护英雄烈士的姓名、肖像、名誉、荣誉，以及保护英雄烈士纪念设施，对侮辱、诽谤英烈或在英烈纪念设施保护范围内进行破坏等行为提起公益诉讼。)",
    "未成年人保护(重点关注校园周边环境整治、网络环境对未成年人的影响、保障未成年人平等接受教育权利、防范侵害未成年人身心健康(如校园欺凌、未成年人网络沉迷、非法雇佣童工等)等问题)",
    "安全生产(监督企业安全生产责任落实情况，针对企业生产过程中存在的重大安全隐患，以及监管部门的不作为或乱作为，导致公共安全事故风险的情形)",
    "个人信息保护(对违法收集、使用、加工、传输、泄露个人信息等行为进行监督，如APP未经授权收集用户敏感信息、企业非法买卖个人信息等)",
    "军人地位和权益保障(保障军人的荣誉、人格尊严以及军人及其家属的合法权益，防止出现侮辱、诽谤军人形象的行为，维护军人依法享有的优先权等权益)",
    "反垄断和反不正当竞争(维护市场公平竞争秩序，对企业的垄断行为(如达成垄断协议、滥用市场支配地位)以及不正当竞争行为(如商业诋毁、虚假宣传、商业贿赂等)进行监督)",
    "反电信网络诈骗(对于侵害国家和社会公共利益的电信网络诈骗行为，如非法获取、出售公民个人信息用于诈骗，或电信运营商、金融机构未履行反诈监管职责等，依法提起公益诉讼)",
    "农产品质量安全(对农产品生产者、经营者的违法行为(如使用禁用衣约、兽约，销售不合格农药品等)导致众多消费者权益受损的情形进行监督)",
    "妇女权益保障(重点关注就业性别歧视、职场性骚扰、妇女人身安全保障、妇女健康检查服务、母婴保健等问题，对侵害妇女合法权益的行为提起公益诉讼)",
    "无障碍环境建设(监督无障碍环境建设情况，确保残障人士、老年人、伤病者等群体在出行、居住、公共服务等方面享有平等便利，对违反无障碍环境建设规定的行为进行监督)",
    "文物和文化遗产保护(对破坏文物本体、在文物保护单位保护范围内进行违法建设、非法买卖文物等行为进行监督，通过公益诉讼要求相关责任方承担修复文物、停止侵害等责任)",
    "国防和军事利益保护(涉及国防和军事设施保护、军事信息安全军人权益保障等与国防和军事利益相关的领域)"
]
# 3. 生成向量 (核心步骤)
# 这一步电脑会进行大量的数学计算，把文字变成数字
start_time = time.time()  
embeddings = model.encode(sentences,batch_size=256, show_progress_bar=True)
end_time = time.time()  
print(f"编码完成，耗时: {end_time - start_time:.2f} 秒")
# 5. 简单演示：计算相似度
query = "您好，我认为这个菜鸟驿站存在一些安全隐患，晚上没有人值班的时候，门也没有关门，可以随意进入。有一些拆掉的快递纸箱随便堆砌。如果有人故意或者不小心扔一个烟头或者火星，我觉得有着火的隐患。菜鸟驿站发生火灾的案例比比皆是。因为这么多快递堆在一起，着起火来情况不堪设想。要求：菜鸟驿站整改，在没有人值守的时候，需要刷卡进入取快递而不是24小时房门大开，确保烟雾报警器和灭火器可以正常使用，人员受到足够的消防意识和培训，拆掉的快递纸盒及时清理，杜绝火灾隐患。	"
query_embedding = model.encode([query])

# 计算余弦相似度 (数学公式，用来算两个向量像不像)
from sklearn.metrics.pairwise import cosine_similarity
import numpy as np

# 计算 query 和那4条数据的相似度
similarities = cosine_similarity(query_embedding, embeddings)
print(f"\n“{query}” 和其他句子的相似度：")
print(similarities)
print(model.device)