import os
from openai import OpenAI
from tqdm import tqdm
from openai import OpenAI
system_prompt="""请对以下12345投诉文本进行分类，其中0类是不属于检察院管辖的范围，而1-20是检察院管辖的范围。每一行是一条数据，仅返回【文本序号：类别编号】、不要多余内容。
类别：
0、非公益诉讼
1、生态环境和资源保护
2、食品药品安全
3、国有财产保护
4、国有土地使用权出让
5、英雄烈士保护
6、未成年人保护
7、安全生产
8、个人信息保护
9、军人地位和权益保障
10、反垄断和反不正当竞争
11、反电信网络诈骗
12、农产品质量安全
13、妇女权益保障
14、无障碍环境建设
15、文物和文化遗产保护
16、国防和军事利益保护
17、控烟/ 公共场所吸烟
18、办卡\协议卡\会员卡、预付式消费相关问题
19、拖欠工资
20、行政检查(行政部门小错重罚或者同案不同罚)"""

text = """
1.此广场内看到烟人抽烟不下十次，与物业投诉过三次，依然在2/10离开健身房时闻到浓郁烟味 诉求：1.整个室内区域没有任何禁烟标志，需全面张贴。 2.派人巡查，遇到抽烟者可罚款，罚款一次就有显著效果。 3.楼道内存在安全隐患，没有灭火器，烟头如果不灭，后果不堪设想，参考香港大火。 4.必要情况可对物业相关公司进行罚款
2.新开的宾馆、饭店等公众聚集场所，是否需要通过消防检查才能开业？
3.您好，您编号为WX20251010372197的事项已经办理完毕，现将办理意见答复如下：市民您好！您通过12345市民服务热线咨询的问题，2025年10月10日上午10时33分，浦东新区消防救援支队已向您进行了电话回复，告知您在“浦东119”微信小程序登记完举报奖励后，支队将统一实施奖励，预计到账时间为1-2个月，请耐心等待。谢谢您对消防的关注【浦东消防支队】
4.停都停不好，开啥车啊
5.表扬蔷薇五村居委书记顾书记，对群众反映的问题迅速响应，协调各方及时解决居民出行问题，是做实事的好干部！表扬信见图
6.早上正常开车出小区，由于垃圾车清理垃圾占用唯一的出车道且没有留空间给着急上班的私家车空间，无奈只能跟车在垃圾车后面，在清理小区第二个垃圾站时，因垃圾车操作员的工作失误导致垃圾车喷射了不明油状物体且持续了一段时间，导致我全车被油膜覆盖根本看不清前方道路以及后视镜，轮胎也有打滑的危险，工作人员明知自己失误却没有当即给我解决措施连道歉都没有，不仅导致我今天上班迟到还要解决车辆油膜问题
7.2023年12月份，网上购买上海霈匠文化公司人民日报一年版，但迄今为止一直未发货，我们催促多次无效，我们要求退款，一直敷衍不予理睬，10月份我们打了投诉电话，霈匠文化给我们发了个信息承诺12月10-15日退款，现已超过9天时间还没有给予办理，请给予帮助，谢谢！
8.家里买了一辆电动车，想装一个充电桩，请问需要什么手续？
9.食品发霉变质,7月23日晚上19:50左右在XXXX（XXXXXXXXXXX），购买2个蛋糕2个面包，总计4件商品。付款方式：会员卡和微信付款。（因卡里余额20多元，购买3件商品后，发现还剩余几元钱，想着用光，后续又买了个小蛋糕用微信补了9元多。 7月24日，上午9点左右，发现其中原味三明治蛋糕发霉（当时已吃了2个面包和小半个三明治蛋糕）。发现问题后和商家及时沟通，商家初始只退款，后加到300元。我现在诉求，1:需医院检查，报销医疗费相关费用及退款赔偿1000元，（因该批商品3人使用，本人夫妻及女儿。）2:彻查该店铺是否违规存放还是其他问题。3:彻查相关供应商是否违规储藏及供应问题。4:该三明治蛋糕储藏标识问题，储藏标识显示0-20度，误导消费者 存放问题,2
10.户口迁回老家,现在国家允许将户籍迁回老家出生地。最近我到XXXXX户籍窗口办理户口事项。户籍窗口民警告知我2024年7月1日起国家对此类迁回老家出生地的户口要么进行公证处公正，要么由人民法院进行栽决，公正栽决都需要花一笔钱，请问XXXXX有没有第三种解决办法，让市民更加节省开支和精力。,0
11.家里无电,家里突然停电，物业查看告知需电力公司上门维修，请帮忙尽快处理,0
12.家中无电,家中突然停电，物业上门查看，告知需电力公司上门维修。请帮忙尽快处理。,0
13.家中无电,家中突然断电，物业查看后告知是表前故障，需要电力公司上门维修，请帮忙处理,0
14.社区民警心系百姓,2024年7月14日上午，XXXXXXX市民发现小区北门口XXXX和XXX口的红绿灯不亮了。XXX区的道路是政府的部门管辖，市民不知道向政府的哪个部门反映。于是打了社区民警X警官的电话。该民警把市民的意见建议放在心上。他考虑到该路口出进人员多，红绿灯不亮容易出交通事故，立即联系政府XXX和路政部门抢修。市民。看到抢修工人施工非常感谢。所以向市民服务热线反映社区民警心系百姓，要求表扬XXXXX的社区民警X警官。,0
15.家中无电,家中无电，物业已查看是电力公司表计故障,0
16.家中无电,家中无电 物业已查看 XXXX表计故障,0
17.长泰周大福买的项链有质量问题,今年2月买了一条黄钻项链，价格17700。周末佩戴时，发现主体钻石变色，XXX销售承认可能存在褪色问题。诉求：退货退款。 商家提出可以换款，但是对XXX的项链质量已经存疑，要求退款。或者调换同等价格的足金饰品，钻石的不要了。,0
18.长泰周大福欺诈消费者 请市场局介入维权,今年2月在XXXXXX买了一条黄钻项链，上周六拿出来佩戴时，发现黄钻颜色变浅。和XXX销售联系后，销售态度非常差，我们去了店里之后，店方承认项链有褪色现象，给出的结论是可以调换。 而且给我们调换商品的是价格高于原先的17700价格的项链。 这是很明显的欺诈消费者，而且项链本身就是存在质量问题。我不要求退一赔三，只要求原价退款，还有XXX要求我们自己去鉴定项链，鉴定费也请一起赔付。,0
19.家中无电,家中无电，物业查看为表前熔丝烧坏，需要电力公司上门维修,0
20.家中无电,家里突然断电了，物业公司上门查看后告知表前熔丝烧坏，需要电力公司派人维修，请尽快帮忙处理,0
21.投诉大润发里面的商铺叫我们办卡现在商铺没,我们在位于XXXXXXXXXX：XXXXX里面买糕点时，里面的工作人员说“叫我们办理她们家的糕点卡”我们办理了，她们说不“可以一直买的时候，派用场，不会过期的”现在好玩了，XXXXX里面的蛋糕店突然没有了，我们当时办的卡也没法用了，我们找XXX理论，XXX售后说“会跟我们解决的”我是今年2月份去找过她们好几次，但是都是不了了之，现在我们只能投诉到你们政府部门了，因为找XXX永远不会帮我们解决问题的，我卡里面的300元，就这样莫名其妙的用不了，就等同于被骗了，所以我要到你们有关部门来反映问题，要XXX赔偿我300元的蛋糕卡里面的钱，既然XXXXX让商铺开在超市里面，也要对我们顾客负责任的，否则我们消费者的利益谁来保护？,0
22.一户多人口,家里用电量大，办理一户多人口有哪些渠道和条件,0
23.感谢信/表扬信,2024年4月22日我女儿XXX因为高烧三天不退至XXXXXXXXXXXXXXXXXXXXXX医生处就诊，但是我们预约号是1000-002号，X医生怀疑我们有川崎病的嫌疑，担心如果是的话延误病情，多方联系，终于在当天做到心脏彩超，最后确诊不是，虚惊一场，但是X医生负责的态度还是让我们非常感动。,0
24.充电桩,家里有一个电车想安装一个充电桩，想咨询一下安装时需不需要向村里报备?需要什么手续吗?,0
25.茶百道喝出异物,6.19下午17.58XXX点了了一杯豆乳米麻薯 快喝完的时候发现吸管内壁上有一根毛和麻薯粘在一起 我以为是睫毛结果扯出来一个很长弯曲的毛很恶心,0
26.什么时候建社区医院？,我们之前买房子时候，给的规划在小区北面会建设一个社区医院，请问什么时候建设？这边现在小区众多，社区医院却没有。看个病要跑个十公里，甚至二三十公里，排队人数众多。请问什么时候配套社区医院能建起来？,0
27.拍写真售后差不退钱,6月7日 我在XXXXXXXXXXXXXXXXXXXX拍写真，起初我和售前客服约定好的是拍199的套餐 包含2服2造。我去之后她们销售跟我讲199的套餐没有底片推荐我拍1599的套餐有底片我觉得太贵了就拒绝了，这个时候她提出拍800的套餐，也是2服2造但是送6张底片。我同意了，7号下午拍完之后我就回家了。一直到12号的凌晨没有人联系我，我从拍摄完回来没有看到一张照片，群里发消息没人回复 我非常气愤要求把加底片的钱退给我，但是她们不退款只说尽快给我选片，我非常气愤这个时候我已经不想要任何照片了，只觉得她们当时把人劝着拍照了收钱了，就不管售后了。在我强烈要求退掉底片的钱之后她们也一直说不退就说尽快选片，我已经感觉到非常气愤无法沟通，求诉无果,0
28.超经营范围食品安全违规举报,XXXX商家：X氏龙虾.烧烤(XXXX)；经营者名称：XXXXXXXXXXX；许可证编号：JY23101120269882；经营地址：XXXXXXXXXXXXXXXXXXXX；经营范围仅为：热食类食品制售；该店售卖：冷菜类；无冷食类食品制售范围，涉嫌超范围经营，要求按照《XXXXXXX食品安全法》第三十五条、我国《食品经营许可管理办法》《XXX食品经营许可管理实施办法》进行立案查处并给予举报奖励。,2
29.对于电动自行车新国标的看法,电动自行车新国标发布已经一段时间，这里尤其重要几点为整车质量低于55KG，速度低于25KM/H，具备脚踏骑行的功能不管用还是不用，电压小于等于48V等，这几条一下子能很多电动自行车由原来的非机动车变成机动车了，因为整车重量进行了限制，所以很多厂家不得不采用更加轻的锂电池，目前电动自行车所用的蓄电池是铅酸电池为主，因铅酸蓄电池发展的比较早技术比较成熟可靠，很少有听说铅酸蓄电池爆炸着火事件，顶多就是鼓包，但是锂电池着火爆炸事件很多，铅酸蓄电池除了用在动力方便，各种车辆内燃机的点火电池也是铅酸蓄电池，所以希望相关指定标准的部门需要综合实际情况来进行，这样到底是对整个社会有利还是不利，现在电动自行车已经成为民众出现的一种工具存在，希望相关部件负责人谨慎对待，如果确实不合理应该需要做出修订，本人认为电压小于等于48V和速度小于等于25km/h都有点不合适，应该电压小于等于60V，速度小于等于35km/h，指定标准的自然都是一些大佬人物咯，如果是自行车，快点骑也有25km/h，那电动的还设置上限是25km/h有啥意义呢，另外脚踏骑行，电动自行车55KG压根蹬不动，如果出现故障直接下来推，很多人不骑。本人愚昧，仅个人观点，希望相关部门采纳。,0
30.老民警最后一次护考,XXXXXXXXXXX老民警XXX还有五天就要退休，但是他还是精神饱满，早上7点30分来到XXXXXXX2024年的高考考试点参加安保工作。我们XXXXXXX的工作人员非常感动。一位家住XXXXXX的考生忘记带身份证，还有一位家住XXXXXX的考生途中遗失身份证。十八分钟内连做两件好事。消除了我们考务工作人员和学生家长的担心。两位学生携带X警官帮助及时办理的临时身份证，顺利参加高考。故来电要求表扬老民警X警官。,0
31.兔宝宝全屋定制意向金拖着不退,4月25日通过XXXXXXXXXX的客服兔宝宝XX所提供的全屋定制订货单和二维码支付1000元作为全屋定制的意向金；客服承诺意向金可以无理由退款。5月18日因为方案和报价不满意，我提出退意向金，客服XX要求提供银行卡号和开户支行报备财务15日退款到账。截止6月1日仍然没有退款到账。投诉1:XXXXXXXXXX的这种意向金以财务报备的方式延迟退款的行为属于侵犯消费者权益的行为，希望兔宝宝能道歉并改正这种行为。同样类型的商家和同样的服务，意向金都是原路秒退。投诉2:请XXXXXXXXXX原路退回意向金。,0
32.电力一户多人口,想办理电力一户多人口业务，由于没时间去电力公司办理，想知道有哪些渠道可以办理，办理需要哪些资料,0
33.高东市场所工作人员态度有问题,到XXXXXXXXXXXX办营业执照，工作人员态度不好，不耐烦。,0
34.非法捕捞,XXXXXXXXXX隔壁水闸。常年有人单人多竿。生产性垂钓。还下丝网。绝户网。地笼。生态环境遭到严重破坏。望有关部门严查。,1
35.食品安全问题,我要申诉的是他们家食品问题，我当天只吃了他们家食品，然后就开始腹疼，拉肚子后去医院检查是急性肠胃炎，医药费总共两次1000多，我去找他们协商只要求赔我商品10倍的价格，也就是269，而他们不仅不在意，说就给200，还说是我自己身体的问题，说自己以前没有出现过这样的问题，你自己看着拿。按照食品安全法，我应该理赔10倍商品的价钱或者损失三倍的赔偿金。如果增加赔偿的金额不足一千元的，为一千元。我只要求269元，甚至没有加上我医药费的1000多，他们就这样敷衍人，还打电话说要线下碰一碰，我实在不知道怎么办了,2
36.警车停放人行道,此警车长期停放在人行道 有时还在人行道上洗车 XXXX是没地方停车了吗？如果没地方停了就请缩减警车配备 身为执法人员 自己却在违法乱纪 难道是权利作祟？,0
37.户籍办理,我和我老婆是XXXX人，都是XX的大学在读硕士，目前还没有毕业，我们如果想把户口从老家迁到XX需要哪些条件要准备哪些手续材料，我想要派出所为我解答一下。,0
38.户口迁移,民警你好，我之前是住在XX农村的，自己的小孩因为跟我一样都是农村户口，所以上学的时候择校有问题，我想知道如何能把小孩的户口迁到城市户口，要准备哪些材料。,0
39.身份证办理,民警你好，我想要咨询一下，我最近因为整容的缘故，实际样貌与身份证样貌有些出入，我需要乘坐高铁飞机的话是否要至所重新办理身份证，而且面部还未完全恢复仍存在浮肿，我怕办理身份证以后过了一段时间又与产生差异，派出所有无解决办法。,0
40.店家跑路充值卡余款追讨,通过该商铺办理蛋糕储值卡，22年12月消费者前往该商家，当时还能消费，当时店家也不提示将关店，否则用户完全可以消费完余额，23年1月再去消费发现该商家已经关门，立刻在12315投诉，处理结果说XXX有店铺押金会确认客户卡余额后退还，历时1年半多反复投诉多次，至今未退，请政府机构帮助维权。 如果还不能还余款，请不要关闭这个投诉。,18
41.海菲秀七天内故障 拒绝处理,购买XXX机器 使用之日三天内产生重大故障。机器无法开机使用！商品质量严重问题。品牌拒绝售后！,0
42.办理外省市人员身份证,我想咨询一下，我是外地户口，在XX工作，身份证需要补办，在工作地XXXXX的派出所是否能办理正式身份证，还是只能办理临时身份证，如果可以办，需要哪些手续和资料。,0
43.上海市第一人民医院（南部）给假媒体供稿,无媒体资质、所有编号弄虚作假的XX2020注册皮包公司“XXXXXXXXX”ISSN今年4.9才申请，之前均公示虚假备案信息，为何给骗子供稿？希望医院维权，公安部门才好抓捕招摇撞骗团伙！第七届XX心血管病论坛于2023年12月26-28日在XXXXXXXXXXXXXXXXX隆重召开 作者：XX XXX XXX供图：XXXXXXXXX（南部） https：//zhuanlan.zhihu.com/p/676158713 https：//cn.kgongcn.com/ssjk/2024-01-05/21515.html https：//m.kgongcn.com/ssjk/2024-01-05/21515.html,0
44.树木砍伐过度,砍成有绿无荫真的有必要吗？大夏天给广大人民群众补钙呢……,0
45.潮宏基金手链质量问题,2024年5月14日下午佩戴在手上的XXX手链（2024年1月28日购买）在无征兆地突然断裂，导致手链的24K黄金组件散落一地，经认真仔细查找收集，最终购买的13.36克金重的手链组件最终只找回9克多点（重量已经第一时间在门店去核实）。由于是手链装配的质量问题导致断裂，要求商家承担责任，做退货且全额退款的处理。 门店商家不同意，要求监管部门介入处理,0
46.加强对电动自行车火灾事故的处罚力度,电动自行车火灾事故频发的一个重要原因就是没有查处事故的责任人。电动车主人是电动车火灾事故的第一责任人，为什么不查处？劣质电瓶的生产企业为什么不查处？电动自行车改装者为什么不查处？老是做些隔靴搔痒的事，不敢刺刀见红，再多的条条框框也是摆设。 希望火灾事故的处理部门要敢于刺刀见红，直接查处事故的责任者，就没有那么多以身试法者了。放松对责任者的处罚，就是执法没有到位，说得不好听XX这么多电瓶车火灾事故，就是对第一起电瓶车火灾事故没有认真查处引发的，查处部门有渎职的嫌疑。,0
47.业务员欺诈,4月3号，一个带有XX工牌，职位是主管的人找到我向我推销卡，我跟他说我不需要，后来他跟我说很优惠，通用流量有45g，只要预充两百元，我还问能不能办了老卡的套餐换成新卡的，新卡并入老卡的副卡，他说可以，次月不用任何操作自动融合（我说了要是不能融合我就不办，我就是为了老卡用新套餐，不然还要多付一张卡的钱） 我办了后，到手只有30g，然后次月没有融合，说需要携转，然后他又说不行了 然后我打了客服电话，他说只能去营业厅把新卡直接作为老卡的副卡，但是套餐不变，也就是说并没有那个业务员说的那样，融合不需要花钱，到了营业厅后营业厅说需要交额外交每月十月，然后我打了XX客服XX客服甚至加价，跟我说准确的说要每月预交十五元，也可以把钱融进去，新卡直接作废，不用额外交钱，但是可能会被XX拉红牌，也就是拉黑名单，拉红牌无法解除 我现在的状态就是，被以欺诈的方式消费了两百元，然后还要每个月多付一个卡的月租，要是融合还得每个月多付十五元，要是融合废副卡会被拉红牌 诉求:帮我把新卡融合到主卡里，并把副卡预存的钱退给我。或者副卡融合到主卡里，原套餐给我加到业务员说的通用45g 工作日我18点后可接电话，双休都可以,18
48.企业占用楼道阻塞消防通道，存在安全隐患,2024年5月11日，在XXXXXXXXXXXXXXXX，1302室的XXXXX占用楼道公共空间，堵塞消防通道，遮挡墙上的消防用具。建议检查该公司存在的消防安全问题，给予警告与处罚。,7
49.消防非必要不要出警,根据该自媒体的说法，这件事情是发生在5月11号的XX，有人报警去让消防救小猫，而消防冒着生命危险在高楼上去救猫，他身上的防护措施也很脆弱，人的生命才是至高无上的，消防员他是保护我们整个城市的安全，没必要花费在这些小事上面，而把自己的人身安危置之不顾，政府不要被这些宠物的爱好者所绑架，非必要不让消防出警，严惩报假警者。,0
50.咨询一户多人口,想办理电费一户多人口的业务，由于没时间去供电公司，想咨询下有哪些渠道可以办理，办理一户多人口需要哪些材料,0
51.办理一户多人口业务,想办理电费一户多人口业务，由于没时间去供电公司，想咨询下有哪些渠道可以办理，办理一户多人口需要哪些材料。,0
52.咨询一会多人口,想办理电费一户多人口业务，由于没时间去供电公司，想咨询下有哪些渠道可以办理，办理一户多人口需要哪些材料。,0
53.一户多人口,想办理电费一户多人口业务，由于没时间去供电公司，想咨询下有哪些渠道可以办理，办理一户多人口需要哪些材料。,0
54.徐汇滨江非法捕捞,继三月投诉后，5月8日凌晨零点35左右，XXXXXXXX附近的XX，又有捕捞现象（工具不详），请核实,1
55.手表故障无法退货,4月8日购买手表之后多次出现问题 睡眠，心率检测不同步 手表连接不上手机 目前手表卡在二维码界面无法使用 联系门店，门店推线上客服，联系线上客服，客服退给门店，无法退货 诉求：要求退货退款,0
56.店铺关门，联系有关人员无回复,办理会员卡，突然店铺关门，没有接到任何通知。知情后联系有关人员，敷衍了事，解决方案不满意。多次与有关人员建议，她们就爱答不理。,18
57.理想汽车降价不合理,XXXX2023款L8购买时几年内不会降价，但现在以调价的形式降价，无论以何种形式的价格。都是对消费者的一种侵害。所有的解释权都是他们说的。XX的老百姓就这么苦吗？钱也是一分一分赚出来的。,0
58.虹桥站出租车司机态度恶劣,我与XXXXXXX出租车载客区排队，上车后告知地点，顾司机（服务卡证号为214410）嫌距离太近，态度恶劣，拒载。我随即下车，向载客区的引导员告知情况，引导员在当时帮助批评了司机，告知不能拒载，让我上车。上车后，司机全程态度恶劣，甚至让我自己开导航！途中也反复说让我短程就不该出租车。但是我也是按引导区指示前来乘坐出租车，在网上搜索后，很多人都在XXX打车时遇到过司机嫌单小，态度恶劣、辱骂的现象，这种风气应该制止！,0
59.表扬同济医院住院部呼吸科李医生,我妈妈XXX于2024年4月8日至4月14日在XXXXXXX三楼XXX4床住院治疗肺炎，住院期间，XXX的所有医生护士都非常热情负责，特别是床位责任医生X医生，认真负责，不厌其烦回答病人和家属的每个问题，而且非常有耐心地把病情分析清楚，让病人都极其安心，连我妈妈都说从没遇到过这么好的医生！X医生医术高超，医德高尚，人民的好医生！,0
60.退款,4月4日经XXXXXXXXXXXX小姐误导下，通过网络平台在未收到连衣裙及发票的情况下，全额支付了3835元给对方，并且承诺不满意可以全额退款。4月8日经线下试穿后不满意要求退款，至今未收到相应退款。请有关部门介入，及时处理退款，履行商家承诺，保护消费者权益。,0
61.表扬 上海市场监督管理局黄浦区外滩所,因在3月12号在XXXXXX内就餐 其牛蛙是生的 回去后腹泻，后经特XXXXXXXXXXXXX？X老师调解 已原路退回支付的费用，特此感谢XXXXXXXXXXX老师，感谢X老师的负责和敬业，麻烦市长热线转答！？？感谢,0
62.上海小益体育文化发展有限公司应受行政处罚,2023年9月6日，举报人与被举报人签订俱乐部会员合同，由被举报人为举报人提供服务，举报人在合同签订日已向被举报人缴纳18000元费用，该充值性质为预付款性质。后因举报人失业原因，举报人选择离开XX生活，于2023年11月2日向被举报人提出退费请求，要求被举报人退回剩余费用，被举报人予以拒绝。时至今日，举报人多次与被协商，被举报人予以无理由拒绝退回款项。请求监管部门对被举报人予以处罚。处罚依据《消费者权益保护法》56条。,18
63.食品检测,本人购买的鸡蛋蛋黄颜色鲜红，我怀疑有苏丹红，请问XXXXXXXX或XXXX附近是否有免费的食品检测点可以检测苏丹红？,0
64.咨询,咨询，辖区治安派出所，有没有权限调解工伤案件,0
65.大神太神团购标准使用不一致,XXXX上看到团购套餐，商家表示199的团购套餐双休日标注了不能使用，建议可以用399的套餐，但是399的套餐内也有写周六周日不可使用，对此表示疑问以后，服务员告知他们也不清楚，只是接到这样的指令,0
66.大润发老香港预付卡关店退费,XXXXXXXXXXXXXXX1楼老XXX。 通过该商铺办理蛋糕储值卡，22年12月消费者前往该商家，当时还能消费，当时店家也不提示将关店，否则用户完全可以消费完余额，23年1月再去消费发现该商家已经关门，立刻在12315投诉，处理结果说XXX有店铺押金会确认客户卡余额后退还，历史1年多反复投诉多次，至今未退，请政府机构帮助维权。,18
67.在包装完好的食品内发现大飞虫,2/18下午在XXX平台下单在XXXXXXX买了36.41的水果，但收到骑手送来的水果后当场发现在包装完好密封的盒子里发现很大的飞虫？？这个虫是在完全密封的盒子里，当时快递员送到后刚下了两层楼就把他又叫上来，他确认是没有拆封的情况下并拍视频为证。存在的严重的食品安全问题和卫生隐患。但是在平台上联系了XXX客服投诉此事。并告知平台这商家不符合5？？？？？？？？？？资质要求严查。并且申请了理赔。之后就收到的理赔19.8元（是下单甘蔗的钱）。2/19日早上收到一电话说是XXXXX的要求我把差评删掉。当时是上班会议室就挂了电话。现在这家商铺至今还是五星好评。而且我的点评只有文字，上传的照片和视频都看不见了？？？请问这是XXX平台和商家一起做出公平公正合理售后服务吗？希望市场监督部门严肃对待此事？？,2
68.loho五角场万达眼镜店,忽悠顾客买了销售提成最大的镜片，让我第二天去取，第二天没取到，不承认说过此话。顾客要求退款，当场不同意。后来我走了之后微信上同意退款。过了一周时间说要提供顾客的银行卡等信息，提供之后又要求顾客要把发票拿到店里去再能走退款流程。一而再地各种为难我。诉求尽快退钱,0
69.反诈中心,XXXX怎么了？！以前正常，有人打电话、发短信骗人，让我投资，付钱……都上报了。2024 年 2 月，又收到几个诈骗信息，我想上报XXXX，没想到，一直反应：举报功能维护中 怎么回事？！无法举报，XXXX，不受理举报了吗？,0
70.电费账单遗失需要补寄,1月份电费账单遗失需要补寄一张,0
71.电费账单遗失,1月电费账单找不到了，希望抄表员再送一张过来,0
72.千寻位置有价兑换码过期,XXXX有价兑换码过期前没有提醒，不给使用，不给退款，不合理，需要恢复或更换新的兑换码,0
73.苏宁易购店大欺客,本人于2月11号在XXXXXXXXXX花12999元买了XX85寸电视机 当时销售员明确告知我们安装时只要买一个支架400元就够了 不用多花钱 而且讲了好几遍 可惜当时没明白 今天2月18号来安装时 因为我们上班 家里只有老人 安装人员既没有出示价目表 也没有出示工作证 就告诉老人85寸电视太大 一个支架不够的 要2个支架 老人以为400元一个 装2个就800元 也没问题 结果装好后告诉老人 这是高级支架 一个950元 2个1900元 老人当时就傻眼了 然后说怎么这么贵 安装人员很轻飘飘的说那不行我就拆了 给你们装400元的就是了 我们是准备结婚的房子 全新的 他说拆 就拆 墙上留洞怎么搞 最后老人只好乖乖掏钱 请问XX 你们这算不算欺榨行为？ 堂堂大XX 我们就是因为害怕网上不正宗 特地跑去实体店买 结果安装人员这种欺瞒行为 看见家里只有两位老人好欺负 这种做法实在无耻到极点 我实名举报并要求公开 给我一个说法 还老人一个公道 我之前打过XX投诉电话 第一个接了 说补偿我50元代金券 我没同意 后面再打电话就直接挂掉了 我这里要求公开 并且我会一直进行投诉,0
74.关于严查电动车违法搭载12岁以上人员问题,问询XX交通管理部门，XX地区最早开始严查“电动自行车违法搭载12周岁以上人员”问题，始于哪一年。或者2017 年以前是或否有过严查“电动自行车违法搭载12周岁以上人员”行动。,0
75.摄像头遮挡标志,XXXXXX十字路口这个摄像头把标志遮挡了,0
76.96110公安反诈电话,XXXXXX警官你好，我在1月29日中午11点31分左右莫名其妙接到XXXXX反诈电话，此时我正在吃饭，不知道XXXXX是什么情况？电话里语音机器人说我本人被人骗了，我在单位食堂好好的吃饭我被谁骗了？没有什么重大事情请不要随便打电话预警，防电信诈骗宣传已经宣传有几十年了，骗子也永远抓不完，你们也不要过度宣传随便打电话预警现在新型诈骗套路辖区派出所也有宣传，希望XXXXX能精确定位真正被骗的市民，讲句实话确实现在XXXXX语音机器人的问题越来越多，我身边很多朋友也开始反感XXXXX乱打电话甚至更为严重问题是半夜三更玩起午夜凶铃，我也知道XXXX的数据大部分来自第三方，这么多的号码也并非都是诈骗电话，误报误判的占多数，计算机大数据不是神仙，还是需要人工去核实的，就包括警官你还有你的同事的手机号也是一样的，我说的对吗，我就说到这里，谢谢！,0
77.反诈电话不停来电,最近一段时间反诈电话不停来电说我有接到要求转账电话，不要上当，事实最近几年都没有接到类似电话，你们初衷是好的，但是希望更精准些，不停来电已经影响到我正常生活,0
78.消费投诉,到店试吃水果是好的，实际给的货跟当初说的不一致，试吃的是新鲜的货，1月份生产的，实际给的是12月初的货物，打开就发现整体果子看上去都是凹陷，软趴趴的，不够新鲜。大家都知道，水果是高度要求新鲜的货物，价格也是不一样的，这是欺诈。这明显是以次充好，狸猫换太子，不诚信。事后投诉，商家不承认，且称坏果在1斤以内不会赔偿，这是哪里的规定，有法律法规依据吗？我们购买之前也没有告知我们1斤以内不处理啊，态度恶劣，不配合，奸商无疑。 我的诉求：退一赔一 要求XXXX对这类奸商严肃处理，整顿市场,0
79.红宝石卡过期需要扣钱续期,持XXXXXXXXX预付费卡，去线下购物，被通知不能扣款使用，理由是已过期，需要拨打021-96801，进行延期并支付2%手续费，延期一次仅3个月有效期，超过时间，必须再次打电话延期，再次支付余额2%手续费才能正常使用。 红宝石预付费卡片前后并没印有开通日期，和延期需要支付余额2%手续费才能使用的提示，而且一次延期有效3个月，超时还得再次支付余额2%手续费才能使用，属于不明码标价乱收费，属于商家单方面霸王条款。 请有关部门核实查办，取消不合理的红宝石预付费卡延期手续费，还消费者公道。,18
80.延长公交线路,建议延长1514路公交车至XXXX至XXX，既方便了XXXX居民去XX上班又能拉动沿途工厂员工去XX消费，一站直达不用换乘（如图），谢谢！,0
81.请金山区消防救援支队回复,火锅门店500平方米左右，请问门店内要配置什么类型的灭火器？配置几个？,0
82.请金山区消防救援支队回复,我租了一间门面店，打算用来开饭店，里面有室内消火栓、灭火器，是不是还需要其他消防设施？,7
83.请金山消防支队回复,想咨询下干粉灭火器和水基型灭火器的适用范围有什么区别,0
84.请金山消防支队回复,您好，想咨询消防安全出口的门一定要防火门吗,0
85.故意不移送生态环境部,今天刚刚收到短消息【XXXXXX】XXX您好。根据您反映的情况，我局执法人员前往XXXXXXXXX开展举报核查工作，经查，您反映的情况为XXX市集活动，活动举办者为XXXXXXXXXXXX，该公司在活动前已依法报备。您反映的油烟问题，依据《XXX大气污染防治条例》第五条、第六十二条等规定，由生态环境部门监督管理。综上，我局决定不予立案。特此告知。[XXXXXXXXXX] 举报人认为，去年12月27号中午12点钟举报的违法行为，油烟大的要命，个别摊位没有安装油烟分离器等，现在你局回复，这个活动已经在你们局报备，报备了就可以不管吗？报备了，你们不提醒他们要安装相关净化装置吗？你们报备了什么东西？既然不是你们管，为什么？大半个月才给我回复，当初收到或者举报，你们认为不是你们管尽快移送环保部门！为什么要拖拖拉拉？这么长时间过去了，你们在告知我再重新举报，有意义吗？ 当地监管作风严重有问题！XXX市民热线上面也有相关规定，不是你们处理的，可以退回举报内容！XX视频热线重新在安排派送相关部门！因为你们拖延时间，造成举报的内容缺失！也是失职行为！要求你局重视！并给处理结果！必须向我赔礼道歉！,1
86.请金山消防支队回复,家住六楼，有一位长期居家行动不便的残疾人，如发生火灾该怎么做。,0
87.请金山区消防救援支队回复,我想开一家火锅店，请问XX这边要办理什么手续,0
88.浦东仁济医院对口仁济药房卖10倍高价药,12月11日上午，我妈去XXXX看特需，挂的XXX主任医师，他给我妈妈开了张手写的单子，让她去医院对面的XXXXXX买骨肽片（西若同），药店售价88一盒，我有购物小票。我回来之后XXXX和XX买药一搜索，上面买最贵的也就10多块一盒，便宜的8块多，我想问这家药店是不是欺诈消费者。要求售价退一赔三。,0
89.公安部门凌晨发骚扰短信,公安部门凌晨2:13分 发骚扰短信 严重扰民,0
90.消防栓损坏存在安全隐患,要求镇级路长与XXXXX主任XX同志履行职责，维修消防栓 我方于2024年1月7日，发现位于XXXXXX、XXXXXXXXX西侧的消防栓损坏，在发生火灾时存在异物堵塞消防栓的情况，请负责人及时处理！,7
91.请金山消防救援支队处理,我想开一家按摩店，需要办理消防手续吗？,0
92.请金山救援支队处理,我想开一家洗脚店，需要什么消防手续。,0
93.请金山区消防救援支队办理,我想开一家零食店，需要安装消防设施吗,0
94.咨询上海市侨务办公室,本市出国人员回X定居如何恢复身份证和户口,0
95.上海出国回沪人员申报户口,XXXXXXXXX：XX出国人员现在回X定居如何申报户口？当初（上世纪90年代）出国前按照本市出入境规定注销了本人身份证和户口。,0
96.请金山消防支队回复,您好，想咨询下干粉灭火器一般多久要维修一次吗，多久为报废年限？请XXXXXX予以回复，谢谢,0
97.请金山消防支队回复,您好，想咨询下如果要开个400平的娱乐场所需要做什么消防方面的准备，请XXXXXX予以回复，谢谢,0
98.96110被用来宣传而不是阻止,96110是官号啊，打电话一定得是有重要事情发生，结果打过来是一个机器人在宣传最新的诈骗手段，这不就和推销的骚扰电话一样么？不要无故消耗自己的公信力好么？！,0
99.询问机构资质,在XXXXXXXXX购买产品与设计图纸不一致事件，XX市场监管部门告知需去鉴定机构鉴定，请告知对鉴定机构有何要求，是否有指定鉴定机构，鉴定完成后续如何维权？,0
100.交通事故逃逸,交通事故逃逸，按违章处理。白色XXX秦,0"""





client = OpenAI(
    base_url='https://dashscope.aliyuncs.com/compatible-mode/v1',
    api_key=os.getenv('DASHSCOPE_API_KEY', ''),
)

# set extra_body for thinking control
extra_body = {
    # enable thinking, set to False to disable test
    "enable_thinking": False,
    # use thinking_budget to contorl num of tokens used for thinking
    # "thinking_budget": 4096
}

response = client.chat.completions.create(
    model='qwen-plus-2025-07-28', # ModelScope Model-Id, required
    messages=[
        {'role': 'system', 'content': system_prompt},
        {
          'role': 'user',
          'content': text
        }
    ],
    stream=True,
    extra_body=extra_body
)
done_thinking = False
for chunk in response:
    if chunk.choices:
        answer_chunk = chunk.choices[0].delta.content
        if answer_chunk:
            print(answer_chunk, end='', flush=True)
